<?php
/**
 * @version 2.0
 * @author  ΤΕΙ Αθήνας
 * @package SYSTEM
 */

header("Content-Type: text/html; charset=utf-8");
require_once('classes/ExportDataTypes.php');
/**
 * **Τύποι Εξαγωγής Δεδομένων**
 *
 * Παρακάτω εμφανίζονται οι Τύποι Εξαγωγής Δεδομένων οι οποίοι χρησιμοποιούνται για την Εξαγωγή Δεδομένων σε συγκεκριμένo format των αποτελεσμάτων μιας συνάρτησης.
 *
 */

class ExportDataEnumTypes extends ExportDataTypes
{

    /**
     * Ο Τύπος Εξαγωγής Δεδομένων επιστρέφει τα αποτελέσματα σε συγκεκριμένο format σύμφωνα με τον Τύπο Εξαγωγής Δεδομένων που έχει οριστεί.
     * <br>Η Εξαγωγή των δεδομένων γίνεται σε json format
     */
    const JSON = "JSON";

    /**
     * Ο Τύπος Εξαγωγής Δεδομένων επιστρέφει τα αποτελέσματα σε συγκεκριμένο format σύμφωνα με τον Τύπο Εξαγωγής Δεδομένων που έχει οριστεί.
     * <br>rΗ Εξαγωγή των δεδομένων γίνεται σε xml format
     */
    const XML = "XML";
    
    /**
     * Ο Τύπος Εξαγωγής Δεδομένων επιστρέφει τα αποτελέσματα σε συγκεκριμένο format σύμφωνα με τον Τύπο Εξαγωγής Δεδομένων που έχει οριστεί.
     * <br>Η Εξαγωγή των δεδομένων γίνεται σε xlsx format
     */
    const XLSX = "XLSX";
    
    /**
     * Ο Τύπος Εξαγωγής Δεδομένων επιστρέφει τα αποτελέσματα σε συγκεκριμένο format σύμφωνα με τον Τύπο Εξαγωγής Δεδομένων που έχει οριστεί.
     * <br>Η Εξαγωγή των δεδομένων γίνεται σε pdf format
     */
    const PDF = "PDF";

    /**
     * Ο Τύπος Εξαγωγής Δεδομένων επιστρέφει τα αποτελέσματα σε συγκεκριμένο format σύμφωνα με τον Τύπο Εξαγωγής Δεδομένων που έχει οριστεί.
     * <br>Η Εξαγωγή των δεδομένων γίνεται σε csv format
     */
    const CSV = "CSV";
    
    /**
     * Ο Τύπος Εξαγωγής Δεδομένων επιστρέφει τα αποτελέσματα σε συγκεκριμένο format σύμφωνα με τον Τύπο Εξαγωγής Δεδομένων που έχει οριστεί.
     * <br>Η Εξαγωγή των δεδομένων γίνεται σε php_array format
     */
    const PHP_ARRAY = "PHP_ARRAY";
    
}

?>