<?php
/**
 * @version 2.0
 * @author  ΤΕΙ Αθήνας
 * @package SYSTEM
 */

header("Content-Type: text/html; charset=utf-8");

/**
 * **Τύποι Ταξινόμησης**
 *
 * Παρακάτω εμφανίζονται οι Τύποι Ταξινόμησης οι οποίοι χρισιμοποιούνται για την Ταξινόμηση των αποτελεσμάτων μιας συνάρτησης.
 *
 */

class OrderEnumTypes extends OrderTypes
{

    /**
     * Ο Τύπος Ταξινόμησης επιστρέφει τα αποτελέσματα σε αύξουσα σειρα σύμφωνα με το Πεδίο Ταξινόμησης που έχει οριστεί.
     * <br>Πεδίο Ταξινόμησης μπορεί να είναι οποιοδήποτε πεδίο επιστρέφει η συνάρτηση στον πίνακα data.
     */
    const ASC = "ASC";


    /**
     * Ο Τύπος Ταξινόμησης επιστρέφει τα αποτελέσματα σε φθίνουσα σειρα σύμφωνα με το Πεδίο Ταξινόμησης που έχει οριστεί
     * <br>Πεδίο Ταξινόμησης μπορεί να είναι οποιοδήποτε πεδίο επιστρέφει η συνάρτηση στον πίνακα data.
     */
    const DESC = "DESC";
}

?>