<?php
/**
 * @version 2.0
 * @author  ΤΕΙ Αθήνας
 * @package SYSTEM
 */

header("Content-Type: text/html; charset=utf-8");

/**
 * **Τύποι Αναζήτησης**
 *
 * Παρακάτω εμφανίζονται οι Τύποι Αναζήτησης οι οποίοι χρισιμοποιούνται για την αναζήτηση στα λεξικά.
 *
 */

class SearchEnumTypes extends SearchTypes
{

    /**
     * Ο Τύπος αναζήτησης ψάχνει να βρεί εγγραφές που είναι ίσες με την τιμή της παραμέτρου
     * <code>
     * παράδειγμα : name = 'τιμή'
     * </code>
     */
    const Exact = "EXACT";


    /**
     * Ο Τύπος αναζήτησης ψάχνει να βρεί εγγραφές που περιέχουν την τιμή της παραμέτρου
     * <code>
     * παράδειγμα : name like '%τιμή%'
     * </code>
     */
    const Contain = "CONTAIN";


    /**
     * Ο Τύπος αναζήτησης ψάχνει να βρεί εγγραφές που περιέχουν όλες τις λέξεις που έχει η τιμή της παραμέτρου οι οποίες έχουν διαχωριστεί με κενό
     * <code>
     * παράδειγμα : name like '%πρώτη_τιμή%' and name like '%δεύτερη_τιμή%'
     * </code>
     */
    const ContainAll = "CONTAINALL";


    /**
     * Ο Τύπος αναζήτησης ψάχνει να βρεί εγγραφές που περιέχουν οποιαδήποτε από τις λέξεις που έχει η τιμή της παραμέτρου οι οποίες έχουν διαχωριστεί με κενό
     * <code>
     * παράδειγμα : name like '%πρώτη_τιμή%' or name like '%δεύτερη_τιμή%'
     * </code>
     */
    const ContainAny = "CONTAINANY";


    /**
     * Ο Τύπος αναζήτησης ψάχνει να βρεί εγγραφές που ξεκινούν με την τιμή της παραμέτρου
     * <code>
     * παράδειγμα : name like 'τιμή%'
     * </code>
     */
    const StartWith = "STARTWITH";


    /**
     * Ο Τύπος αναζήτησης ψάχνει να βρεί εγγραφές που τελειώνουν με την τιμή της παραμέτρου
     * <code>
     * παράδειγμα : name like '%τιμή'
     * </code>
     */
    const EndWith = "ENDWITH";

}

?>