<?php
header("Content-Type: text/html; charset=utf-8");

echo "<pre>";

$string = "Αιγάλεω γυμνάσιο|δημοτικό, Χαϊδάρι !λύκειο";
$string = "Αιγάλεω|Χαϊδάρι ειδικό μουσικό !δημοτικό";
$string = "Αιγάλεω|!Χαϊδάρι|Περιστέρι !λύκειο !γυμνάσιο";

$groups = preg_split("/[\s]*[,][\s]*/", $string);
var_dump($groups); echo "<br><hr>";


foreach ($groups as $group)
{
    $lines = preg_split("/[\s]*[ ][\s]*/", $group);
    var_dump($lines); echo "<br><hr>";


    $wordset = array();
    foreach ($lines as $lineword)
    {
        $wordset[] = preg_split("/[\s]*[|][\s]*/", $lineword);
    }
    var_dump($wordset); echo "<br><hr>";   
    
    
    $query = "";
    foreach($wordset as $words)
    {
        if (count($words) == 1)
        {
            $isNot = substr($words[0], 0, 1) == "!" ? true : false;
            
            $sql = ($sql ? " AND ": "")
                   . "( %s" . ($isNot ? " NOT" : "")
                   . " like \"%%".($isNot ? substr($words[0], 1) : $words[0])."%%\")";
        }
        else 
        {
            $sql = "";
            foreach ($words as $word)
            {
                $isNot = substr($word, 0, 1) == "!" ? true : false;

                $sql .= ($sql ? " OR ": "")
                        . "( %s" . ($isNot ? " NOT" : "")
                        . " like \"%%".($isNot ? substr($word, 1) : $word)."%%\")";
            }            
            $sql = "(".$sql.")";
            
        }
        $query .= $sql;
        //var_dump($word);
        echo $query."<br>";
    }
}



echo "</pre>";
/*
Regular Expression

Τελεστές
! 	: not
| 	: ή
κενό 	: και
,	: ένωση προτάσεων (πολλαπλή αναζήτηση)

Παραδείγματα χρήσης
Αιγάλεω γυμνάσιο
Όλες οι μονάδες του δήμου Αιγάλεω που είναι γυμνάσια

!Αιγάλεω γυμνάσιο
Όλες οι μονάδες εκτός του δήμου Αιγάλεω που είναι γυμνάσια

Αιγάλεω γυμνάσιο|δημοτικό
Όλες οι μονάδες του δήμου Αιγάλεω που είναι δημοτικά ή γυμνάσια

Αιγάλεω !γυμνάσιο|!δημοτικό
Όλες οι μονάδες του δήμου Αιγάλεω που δεν είναι ούτε δημοτικά ούτε γυμνάσια

Αιγάλεω μουσικό !δημοτικό
Όλες οι μονάδες του δήμου Αιγάλεω που είναι μουσικά εκτός από τα δημοτικά

Αιγάλεω|Χαϊδάρι ειδικό μουσικό !δημοτικό
Όλες οι μονάδες του δήμου Αιγάλεω ή Χαϊδάρι εκτός από τα δημοτικά που είναι και μουσικά και ειδικά 

Αιγάλεω|Χαϊδάρι|Περιστέρι !λύκειο|!γυμνάσιο
Όλες οι μονάδες του δήμου Αιγάλεω ή Χαϊδάρι ή Περιστέρι που δεν είναι ούτε λύκεια ούτε γυμνάσια

Αιγάλεω γυμνάσιο|δημοτικό, Χαϊδάρι !λύκειο
Όλες οι μονάδες του δήμου Αιγάλεω που είναι δημοτικά ή γυμνάσια και όλες οι μονάδες του δήμου Χαϊδαρίου που δεν είναι λύκεια


 */
?>
